8.关于G1的命题1:∀g∈ G,
    g∈G1
    ↔
    wi(g)=0 , ∀i , 1<=i<=12
    证明：
    （换句话说：右推左其实也就是说，棱块方向都没变的状态，可以通过G1的生成集来生成。）
    左推右：
    {
        对g的操作长度作归纳：
        1.首先g的长度为1验证：只需要验证G1（ <L^2,R^2,F,B,U,D>）中的6个生成元，都满足。
        2.假设对于任意长度为k的时候成立，也就是：wi(X_1X_2...X_k) = 0 , ∀i , 1<=i<=12
        3.验证长度为k+1的时候，也就是g=X_1X_2...X_kX_(k+1) , 需要验证：wi(X_1X_2...X_kX_(k+1)) = 0 , ∀i , 1<=i<=12
        4.由于之前的类同态定理，我们已知w(X_1X_2...X_kX_(k+1)) = w(X_1X_2...X_k) + σ(X_1X_2...X_k)^(-1)·w(X_(k+1))
        5.因此需要验证的目标，变成新的目标：wi(X_1X_2...X_k) + [σ(X_1X_2...X_k)^(-1)·w(X_(k+1))]_i  , ∀i , 1<=i<=12
        = [σ(X_1X_2...X_k)^(-1)·w(X_(k+1))]_i  , ∀i , 1<=i<=12   因为假设，X_1X_2...X_kX_(k+1)的所有分量都是0，换句话说就是wi(X_1X_2...X_k) = 0
        = 0 , ∀i , 1<=i<=12   因为w(X_(k+1))的每个分量都是0，不管怎么重新排列，还是全零。
    }
    右推左：
    {
        0.已知wi(g)=0 , ∀i , 1<=i<=12，换句话说，棱块的方向数全部为0。
        0.1 g∈G,也就是g是可还原魔方群的一个元素。（换句话说，可以使用魔方第二基本定理）
        1.由于目标是要推出g∈G1,换句话说，换成新的目标：就是g状态可以通过G1中的元素复合得到e。
        2.给出不改变全体位置,且不改变全体棱块的方向数的前提，只单纯还原全体角块的方向数的操作步骤：
            1.关键公式：h1 = (D' L L D B' R R B)^2 ,效果：4号方向数+1，6号方向数+2
            （下面应该不止用到h1,还会用到一些包含h1的交换子公式）
            2.(涉及U,h1)先依次还原这些角块的方向数为0:1号块，2号块，3号块。故意留一个4号块。
            3.(涉及D,h1)先依次还原这些角块的方向数为0:5号块，8号块，7号块。故意留一个6号块。
            4.最后执行若干次h1,使得4号方向数变成0后。此时只剩一个2号块方向数不一定还原为0。
            5.此时对目前状态进行分析，因为目前状态依然∈ G,可以使用魔方第二基本定理的第3条件，角块方向数求和mod 3为0
                因为2号块以外方向数都为0，因此这个2号块方向数也只能满足mod 3为0，因此也是0。
        3.给出不改变全体方向数的前提，只单纯还原全体位置的操作步骤：
            1.关键公式：h2:R R U' F B' R R F' B U' R R: 效果：棱块3位置轮换：(1,2,3)
            2.关键公式：h3:D F' D B B D' F D B B D' L L (D' L L D B' R R B)^2 L L D':效果：角块3位置轮换：（5,4,8）
            3.关键公式：h4:(U' R R)^4 U' (D' F' D B B D' F D B B)^2 (D' L L D B' R R B)^4：
                效果：角块2位置轮换：1↔7
                    + 棱块2位置轮换：2↔10
            4.借用魔方第二基本定理的右推左中的讨论（换句话，这里偷懒不写），必然得到任意棱块3循环，角块3循环。
            因此能生成所有的({A8},{A12},id,id)状态。
            5.由于目前状态∈ G,所以满足魔方第二基本定理中的第一条，角块排列和棱块排列的奇偶性只可能是奇X奇 or 偶X偶。
            6.类似于魔方第二基本定理的右推左中的讨论，奇X奇可以通过执行一次h4，化归为偶X偶的情况，也就是({A8},{A12},id,id)中的一种状态。
            7.因此能被全体3循环生成。
    }

9.G2 = <L^2,R^2,F^2,B^2,U,D> 具有性质：
    1.不改变任何棱块的方向。
    2.不改变任何角块的方向。
    3.而且保持（上下）中层的棱块（5，6，7，8）保持在（上下）中层的四个位置（5，6，7，8）上（也可以称作轨道）。
10.关于G2的命题2:∀g∈ G1,
    g∈ G2
    ↔
    {
        1. vi(g)=0 , ∀i , 1<=i<=8
        2. σ(g)作用到 {5,6,7,8}这4个棱块后，这4个棱块仍然全都在位置{5,6,7,8}上，
            换句话说，这4个棱块经过g变换后保持在（上下）中层里。
    }
    证明：
    左推右：
    {
        对g的操作元素数量l作归纳：
        1.首先对l=1时验证v：只需要验证G2的6个生成元都符合。
        验证保持轨道{5,6,7,8}：只需要验证G2的6个生成元都符合。
        2.然后假设任意l=k时成立，也就是：
        vi(X_1X_2...X_k)=0 , ∀i , 1<=i<=8
        还有，
        σ(X_1X_2...X_k)这个排列的结果使得保持轨道{5,6,7,8}
        3.现在验证l=k+1的情况，当g=X_1X_2...X_kX_(k+1) ，目标有2个：
            1.目标：vi(X_1X_2...X_kX_(k+1))=0 , ∀i , 1<=i<=8
            证明：由于类同态定理，v(X_1X_2...X_kX_(k+1)) := v(X_1X_2...X_k) + ρ(X_1X_2...X_k)^(-1)·v(X_(k+1))
                由于假设，我们已知：v(X_1X_2...X_k) = (0,...,0) (8个项)
                所以 vi(X_1X_2...X_kX_(k+1)) = [ρ(X_1X_2...X_k)^(-1)·v(X_(k+1))]_i , ∀i , 1<=i<=8
                = 0 由于v(X_(k+1))的分量每一项都是0，如何重新排列还是全零。
            2.目标：σ(X_1X_2...X_kX_(k+1))使得保持轨道{5,6,7,8}
            证明：由于假设，已知：σ(X_1X_2...X_k)这个排列的结果使得保持轨道{5,6,7,8}
            由于我们知道X_1X_2...X_kX_(k+1)的排列效果，相当于，↔ 先作用X_1X_2...X_k的排列效果，然后再作用一次X_(k+1)，其实就是σ的“同态”性质。
            所以我们得到σ(X_1X_2...X_kX_(k+1)) = σ(X_1X_2...X_k) · σ(X_(k+1))
            因为两次效果都保持轨道{5,6,7,8}，因此合并效果σ(X_1X_2...X_kX_(k+1)) 也保持轨道{5,6,7,8}。
    }
    右推左：
    {
        0.已知g∈ G1, 目标是证明g∈ G2,换句话说，可以换个目标：只用G2中的复合操作，使得g还原成状态e。
        1.由假设知vi(g)=0 , ∀i , 1<=i<=8
        2.由假设知已知 σ(g)作用到 {5,6,7,8}这4个棱块后，这4个棱块仍然全都在位置{5,6,7,8}上，
            换句话说，这4个棱块经过g变换后保持在（上下）中层里。
        3.由g∈ G1，上一个命题的充要条件知：wi(g)=0 , ∀i , 1<=i<=12
        4.现在给出还原成状态e的具体步骤，采取棱块和角块分别还原互不干涉的思路，分类讨论：
            0.由于全体块的方向数都已经还原成0，所以只需要分类讨论棱块和角块的位置还原：
                {
                    这里不做具体步骤，只做大概的步骤分析：
                    1.首先全体块被分成了3个轨道：
                        1.棱块{5,6,7,8} ； 2.棱块除了{5,6,7,8}以外的块 ； 3.全体角块
                    2.要想还原棱块和角块的位置，只需要找到3个轨道分别的一个3循环操作。
                        具体如下:
                        {
                            h5:(R R F F U U)^4 (R R F F)^3 U U (R R F F)^3 U U : {5,6,7,8}的3循环：(5,6,7)
                            h6:(U U F F L L)^4 (U U F F)^3 L L (U U F F)^3 L L: 棱块除了{5,6,7,8}以外的块的3循环：(1,3,9)
                            h8:R R U L L U' R R U L L U':全体角块的3循环： (7,2,8)
                        }
                    3.这些3循环可以通过交换子引理变换成任意的3循环。
                    4.还原步骤就是让3个轨道用这些3循环公式，最后分别留下2个没有还原的。也就是6个块没有还原位置。
                    5.然后其实还需要2个轨道之间的同时2循环公式即可，因为轨道之间的同时作用使得其中1个轨道能还原位置，
                        作用2次后，最后只剩下一个轨道的2个块不确定是否已经还原位置，这时候用魔方第二基本定理的条件(1)可以肯定，
                        这两个剩下的块一定会被动的还原了，不需要再操作。
                        具体2循环公式如下，但不一定都用到，只用到其中两个即可，因为只有3个轨道:
                        {
                            h7:(R R U U)^3 :棱{5,6,7,8} 与 棱{1,2,3,4,9,10,11,12}轨道的同时2循环：1↔3, 6↔7
                            h9:(U' R R)^4 U U D R R U L L U' R R U L L D' ：棱{1,2,3,4,9,10,11,12}轨道 与 全体角块 的同时2循环：角1↔4, 棱2↔10
                            h10:(U' R R)^4 U U D R R U L L U' R R U L L D' R R U D' (U U F F L L)^4 (U U F F)^3 L L (U U F F)^3 L L D U' R R (U U F F)^3
                            ：棱{5,6,7,8}轨道 与 全体角块 的同时2循环
                                等价操作：L' L' U B' B' U' U' R' R' U' R' R' U F' F' D L R F' F' U' U' L' R U'
                                :角1↔4, 棱5↔6
                        }
                }
    }
11.1. G = <L,R,F,B,U,D> → G1 = <L^2,R^2,F,B,U,D>  → G2 = <L^2,R^2,F^2,B^2,U,D> → G3 = <L^2,R^2,F^2,B^2,U^2,D^2>
11.G3 = <L^2,R^2,F^2,B^2,U^2,D^2> 具有性质：
    1.不改变任何棱块的方向。
    2.不改变任何角块的方向。
    3.棱块保持轨道: {5,6,7,8}。
    4.棱块保持轨道：{1,3,9,11},{2,4,10,12}。
    5.角块保持轨道：{1,3,6,8},{2,4,5,7}。
    6*.一个否命题：不会产生角块位置的三轮换，具体来说就是{1,3,6,8},{2,4,5,7}这两个角块的轨道中，不包含三轮换。
12.关于G3的命题3:∀g∈ G2,
    g∈ G3
    ↔
    {
        1.棱块有2个轨道：{1,3,9,11},{2,4,10,12}，当然也有{5,6,7,8}
        2.角块有3个轨道：{1,3,6,8},{2,4,5,7}
        (3错误的？.{1,3,6,8},{2,4,5,7}这两个角块的轨道中，不包含三轮换。
            换句话说，g的效果不能产生这些轨道内的3循环。
            换句话说，g不是单纯的棱块3循环（不变全体块的方向数，不变角块的位置）)
        3.与这个白色面心块颜色不一样的角块的个数,记为Count,Count是偶数。这里先特指白色面中，和白色不一样的角块的（白色的）个数Count，Count是偶数个。
    }
    证明：
    关键公式：
    {
        h11:(R^2F^2)^3 :两个轨道的棱块2循环 :1↔9, 2↔10
        h14:(L^2U^2)^3 :即（L L U U L L U U L L U U）：两个轨道的棱块2循环 :5↔8, 1↔3
        h17:L L B B F F R R D' L L B B F F R R U: 两个轨道的棱块2循环 :1↔3, 2↔4
        h18:L L B B F F R R D L L B B F F R R U:两个轨道的角块2循环 :1↔3, 2↔4
        --
        h12:(R^2F^2)^3(R^2B^2)^3 :一个轨道的棱块2循环（可变式成另一个轨道） :1↔9, 3↔11
        h15:F^2U^2D^2B^2U^2D^2:即F F U U D D B B U U D D：一个轨道的棱块2循环：5→6,7↔8
        --
        h13:(R^2F^2U^2)^4(R^2F^2)^3U^2(R^2F^2)^3U^2 : R R F F U U R R F F U U R R F F U U R R F F U U R R F F R R F F R R F F U U R R F F R R F F R R F F U U :
            一个棱块轨道的3循环：(5,6,7)
        h16:F^2L'RU^2LR' :（即F F L' R U U L R'）：一个棱块轨道的3循环：(1,9,3)
    }
    左推右：{
        0.由于g∈ G2, 所以已知：
            1. vi(g)=0 , ∀i , 1<=i<=8
            2. σ(g)作用到 {5,6,7,8}这4个棱块后，这4个棱块仍然全都在位置{5,6,7,8}上，
            换句话说，这4个棱块经过g变换后保持在（上下）中层里。
        1.首先证明棱块保持轨道{1,3,9,11}：只需要验证G3生成元6个都符合就行。复合操作自然也符合。
        2.证明棱块保持轨道{2,4,10,12}：只需要验证G3生成元6个都符合就行。
        3.证明角块保持轨道{1,3,6,8}：只需要验证G3生成元6个都符合就行。
        4.证明角块保持轨道{2,4,5,7}：只需要验证G3生成元6个都符合就行。
        5.证明白色面心块颜色不一样的角块的个数为偶数的性质，换句话说就是白色面的角块的黄色的个数为偶数，要对g的长度做归纳：
            0.对于g长度为1的情况：只需要检查6个G3中生成元即可。
            1.以下分析长度为1的情况都满足“白面黄角为偶数”的性质时，再作用1次任意G3元素后，“白面4个角块”的颜色会有哪些可能的情况。
            2.对长度为1时，黄角的个数做分类讨论：
            {
                只能是偶数:
                1.U面有4个黄色：再作用1次后，“白面4个角块”是“4黄”。
                2.U面有0个黄色：再作用1次后，“白面4个角块”是“0黄”。
                3.U面有2个黄色：此时D面也有2个黄色，分析第1次操作后所有可能的“白面4个角块”的分布：{
                    1.第1次操作为L2: 14-67 (表示角块1467是黄色)
                    2.第1次操作为R2: 23-58
                    3.第1次操作为F2: 12-78
                    4.第1次操作为B2: 34-56
                    总结就是56-78 => 14-67,23-58,12-78,34-56
                }
            }
            3.对长度为2时，分析所有可能的“白面4个角块”的分布：{
                对上面长度为1时的4种情况进行第2次任意G3的操作，容易得知第2次操作后所有可能的“白面4个角块”的分布：{
                    新出现的状态用引号标记：
                    1.14-67=>14-67,56-78,14-67,"12-34"
                    2.23-58=>23-58,12-34,23-58,56-78
                    3.12-78=>56-78,12-78,12-34,12-78
                    4.34-56=>12-34,34-56,56-78,34-56
            }
            4.对长度3时，分析所有可能的“白面4个角块”的分布：{
                这时候再对长度为2时的所有操作进行第3次任意G3的操作，只有“12-34”会出现新的分布，所以只需要分析它，
                换句话说，其他的再怎么操作，都可以满足“白面4个角块”的性质。
                12-34=>34-56,23-78,12-78,14-67
                很明显，所有可能的情况已经封闭了，只有这些可能：
                56-78,14-67,12-34,23-58,12-78,34-56
            }
            5.所以长度n时，分析所有可能的“白面4个角块”的分布也只会局限在{56-78,14-67,12-34,23-58,12-78,34-56}
            到此证明归纳结束。
        6*无关推理：G3操作中是否会出现单纯的角块3轮换？1.是；2.否（只能二选一）。
            因为单纯的角块3轮换：也就是其他块位置不变，方向不变。
            这种单纯的角块3轮换存在，会导致U面出现黄色的个数为奇数，和5矛盾。因此不存在这样的单纯的角块3轮换。
    }
    右推左：{
        1.换成新目标：g可以用G3中的生成元素复原回状态e。
        2.已知G2和G3中元素不会改变方向数，所以以下只需要分析位置即可。
        因此换成新目标：g的角块位置可以通过G3还原成原始排列位置，g的棱块可以通过G3还原成原始排列位置。
        -- 到底先证明棱块，还是先证明角块呢？角块貌似条件多一点...
        -- 先尝试：先角后棱：
        3.先还原角块的位置，看看如何还原到8个原始的排列位置，详细步骤：
            （思路还未知，可能的思路：1.通过分类讨论，用到假设条件的3,4推理，再还原若干个后，然后排除那些还没还原的情形，
            因此剩下的一定能自动还原。）
            0.首先还原1，4号位置的白色角块：
            1.1号位置白色UFL：
                1.首先{1，3，6，8}轨道肯定有白色，这是因为假设（2），这个轨道{1,3,6,8}中保持有2个白色。
                2.将1或3或6或8号位置的一个白色，通过h18或“包含h18的1次交换子”即可到达1号位置。
                至此1个角块位置已还原。
            2.还原3号位的白色角块：
                1.由于{1，3，6，8}轨道还有一个白色，这是因为假设(2)。
                2.3或6或8号位置的一个白色，通过h18或“包含h18的1次交换子”即可到达3号位置。
                至此2个角块位置已还原。
            3.还原4号位置UBL也是类似，从{2,4,5,7}轨道的2个白色中选一个，
                通过h18或“包含h18的1次交换子”即可到达4号位置。
                至此2个角块位置已还原。
                但注意，此时1，3号被动换了一次位置。准确来说至此1个角块位置已还原，且1，3号位置刚好互换了。
            4.然后考虑2号位置的白色角块：
                1.由于{2,4,5,7}轨道中还有一个白色，这是因为假设(2)。
                分类讨论：
                    1.如果白色在2号位置：则不需操作，已还原2号位置。
                    2.白色在5:
                        通过h18或“包含h18的1次交换子”即可到达2号位置。且把1，3号位置交换回来正确。
                    3.白色在7:
                        通过h18或“包含h18的1次交换子”即可到达2号位置。且把1，3号位置交换回来正确。
                    4.总结：{2,4,5,7}轨道中的剩下的1个白色只能在2，因此U面的白色已经全部还原。
                至此4个角块位置已还原。
            5.然后考虑D面的4个角块的位置：
            “位置正了”：只剩的两个位置排列是对的。
            “位置反了”：只剩的两个位置排列是交换的。
            ，分类讨论：
            {
                1.2正：ok
                2.2反：ok
                3.1正1反，1反1正：首先1反1正可以通过h18归化成1正1反，
                    这时候就能使用假设条件3，1正1反这种情况，和“白面维持偶数个黄角块”的性质是矛盾的
                    换句话说，满足当前假设的状态集中，是不存在这种情况的，不需要讨论。
            }
        4.再还原棱块的位置：
            (思路：此时角块位置已还原，会用到魔方第二基本定理来处理最后一步)
            1.首先由于假设条件，棱块目前满足保持3个轨道：{1,3,9,11},{2,4,10,12}，{5,6,7,8}
            2.还原棱块的具体步骤：
            (h11到h18不一定都用到)
            {
                1.先还原棱轨道{5,6,7,8}的位置：通过h13或者h13变式，使得5，6先还原位置。故意留下7，8位置。
                2.使用0次或1次h15,这样棱轨道{5,6,7,8}必然能还原位置成功。
                3.剩下的两个轨道{1,3,9,11},{2,4,10,12}
                4.还原轨道{1,3,9,11}位置：通过h16或者“包含h12的交换子”，使得9，11还原位置。故意留下1，3位置。
                5.还原轨道{2,4,10,12}位置：通过h16的变式，已经“包含h16的变式的交换子”，使得10，12还原位置。故意留下2，4位置。
                6.还原轨道{1,3,9,11}，执行0次或1次h17,这样{1,3,9,11}肯定能全部位置还原。
                7.现在就剩下2，4位置。这时候我们就可以使用魔方第二基本定理的条件(1),错误的位置，也就是2和4错误，是不可能存在的，所以2和4已经被前面步骤被动还原。
            }

    }
