

目标：
假设g∈ G2 ,以下2个命题可以互推
{
  g∈G3 （<L2,R2,F2,B2,U2,D2>）
}
↔
{
  1.g使得棱块保持2个新轨道。{1,3,9,11},{2,4,10,12}
  2.g使得角块保持2个新轨道。{1,3,6,8},{2,4,5,7}
  3.g使得{1,3,6,8}单纯改变角块3循环位置，方向数不变。 => False
  4.g使得{2,4,5,7}单纯改变角块3循环位置，方向数不变。 => False
}

证明：
左推右：{
  1.首先证明棱块保持轨道{1,3,9,11}：只需要验证G3生成元6个都符合就行。
  2.证明棱块保持轨道{2,4,10,12}：只需要验证G3生成元6个都符合就行。
  3.证明角块保持轨道{1,3,6,8}：只需要验证G3生成元6个都符合就行。
  4.证明角块保持轨道{2,4,5,7}：只需要验证G3生成元6个都符合就行。
  5.小引理：G3使得任意一个面，与这个面心块颜色不一样的角块的个数,记为Count,Count是偶数。
    这里先特指白色面中，和白色不一样的角块的（白色的）个数Count，Count是偶数个。
    证明：
    1.定义c:c(g)是8项的向量，每一项只能取0或1，每一项代表角块i在新坐标下U或D面的颜色数增加量（结果要mod 2），0代表白色，1代表黄色。可以记为c(g)=(c1(g),c2(g),...,c8(g))
    2.小引理：c(gh) = c(g) + ρ(g)c(h)
        证明：类似类同态定理的证明过程。
    3.对g的长度做归纳：
      0.对于g= X_1X_2...X_kX_(k+1)
      1.对于g长度为1的情况：只需要检查6个G3中生成元即可。
      2.假设：对于k成立，也就是已知：∑(上4，下i=1)ci(X_1X_2...X_k) = 0 (mod 2)，（而且也知道反面：∑(上8，下i=5)ci(X_1X_2...X_k) = 0 (mod 2)）
      3.现在检查k+1的情况：∑(上4，下i=1)ci(X_1X_2...X_kX_(k+1))
      4.由于小引理2，可知c(X_1X_2...X_kX_(k+1)) = c(X_1X_2...X_k) +  ρ(g)c(X_(k+1))
      5.所以3中的检查目标，可以化归为：∑(上4，下i=1)[ci(X_1X_2...X_k) +  (ρ(g)c(X_(k+1)))_i  ]
      = 0 + ∑(上4，下i=1)(ρ(g)c(X_(k+1)))_i (mod 2) 因为代入k的假设
      = 0 （mod 2）
        为什么∑(上4，下i=1)(ρ(g)c(X_(k+1)))_i = 0 (mod 2)？
        （是否G2也满足这个条件呢？）
        证明：
            c
        L2: XXXXXXXX
        R2: XXXXXXXX
        F2: XXXXXXXX
        B2: XXXXXXXX
        U2: XXXXXXXX
        D2: XXXXXXXX
        --
        对g的长度做归纳：
        1.g的长度为1时：很容易验证U面依然保持偶数个黄色。
        2.假设对于m成立，也就是：∑(上4，下i=1)(ρ(X_1X_2...X_m)c(X_(k+1)))_i = 0 (mod 2)
        3.验证对于m+1的情况：
        设g=X_1X_2...X_mX_(m+1)
        ∑(上4，下i=1)(ρ(X_1X_2...X_mX_(m+1))c(X_(k+1)))_i
        =∑(上4，下i=1) (ρ(X_(m+1))ρ(X_1X_2...X_m)c(X_(k+1)))_i 由于ρ的定义，先作用前m个，再作用1个。效果等同于直接作用“前m个和最后一个的复合”。
        =

        {
          因为？
          因为对于单个操作X_(k+1)已经验证过成立。
        }
    到此证明归纳结束。
  6.是否存在单纯的角块3轮换？1.是；2.否（只能二选一）。
    因为单纯的角块3轮换：也就是其他块位置不变，方向不变。这种单纯的角块3轮换会导致U面出现黄色的个数为奇数，和小引理5矛盾。因此不存在这样的单纯的角块3轮换。
}
右推左：{
  1.换成新目标：g可以用G3中的生成元素复原回状态e。
  2.已知G2和G3中元素不会改变方向数，所以以下只需要分析位置即可。
  因此换成新目标：g的角块位置可以通过G3还原成原始排列位置，g的棱块可以通过G3还原成原始排列位置。

  -- 到底先证明棱块，还是先证明角块呢？角块貌似条件多一点...
  -- 先尝试：先角后棱：



  3.先分析角块的位置，看看如何还原到8个原始的排列位置，详细步骤：
    （思路还未知，可能的思路：1.通过分类讨论，用到假设条件的3,4推理，再还原若干个后，然后排除那些还没还原的情形，
      因此剩下的一定能自动还原。）
    1.首先还原1，4号位置的白色角块：
      1.1号位置白色UFL：
        1.首先{1，3，6，8}轨道肯定有白色，因为：假设（2），这个轨道{1,3,6,8}中保持有2个白色。
        2.将3或6或8号位置的一个白色，先移到6号位置，然后使用U^2即可到达UFL
        至此1个角块位置已还原。
      2.同样4号位置UBL也是类似，从{2,4,5,7}轨道的2个白色中选一个先到达7号位，然后再用B^2到达UBL。
        至此2个角块位置已还原。
    2.然后再还原3号位的白色角块：
      1.由于{1，3，6，8}轨道还有一个白色，这是因为假设(2)。
      2.将3号位置UBR还原白色角块位置：操作也是先到达6号位置然后使用R^2即可到达UBR。
        至此3个角块位置已还原。
    3.然后考虑2号位置的白色角块：
      1.由于{2,4,5,7}轨道中还有一个白色，这是因为假设(2)。
      分类讨论：
        1.如果白色在2号位置：则不需操作，已还原2号位置。
        2.白色在5:则2-黄，7-黄 ； 6-黄，8-黄。
            1.假设棱块已还原，则棱块排列符号数为0。
            2.角块原排列是12345678
            3.现在是1，4，3正确，但是2跑到了5号位：1X3426X8 , 两个X分别是5，7
            4.因为魔方第二基本定理，棱和角的排列数相等，所以只能是17342658，因为：15342678 =3+1+1=5 ，17342658=5+1+1+1=8，
            5.分析17342658，有没有可能呢？分析轨道{2,4,5,7}，发现这个是一个3循环(7,2,5),使用假设(4),可以退出False，因此白色不在5。
        3.白色在7:
            由于对称性，和上述推理类似吧？所以白色不在7。
        4.总结：{2,4,5,7}轨道中的剩下的1个白色只能在2，因此U面的白色已经全部还原。
      至此4个角块位置已还原。
    4.然后考虑D面的4个角块的位置：
      “正了”“反了”，分类讨论：
      {
        1.2正：ok
        2.2反：ok
        3.1正1反，1反1正：首先1反1正可以通过h18归化成1正1反，
          1.这里以这个为例子：14325678,是否能否定这种情况的存在呢？
          （1.往奇偶数方向找矛盾，还是
            2.3循环的矛盾，还是
            3.3循环改成广义2循环的新条件呢？）
          2.
      }


      1.首先考虑轨道{1，3，6，8}剩下的:
        1.由于只剩下2个D面的位置不知道还原了没有，分类讨论：
          1.初始的6号块在位置6，初始的8号块在位置8:则已经还原位置。
          2.初始的6号块在位置8，初始的8号块在位置6:
      2.考虑轨道{2,4,5,7}剩下的:

  4.分析棱块的位置：
    （这里思路未知：很有可能需要单独还原棱块位置，而不改变任意角块的位置）

}
