







证明这一步是为了证明所有棱块3循环能还原，因此能生成所有A12（全体方向数为0，角块位置id）。

g3:R U' R U R U R U' R' U' R R
目标：任意棱块3循环（棱块方向数为0，角块位置为id），可以用g3和g3变式和交换子模式还原成e。
（硬要一个个列举的话，12个选3循环有220中不同的。）
证明：
1.要对这3循环的位置进行分类，首先为了不失一般性，
把其中一个棱块E1放在人的正面朝上的位置，
换句话说，就是把E1当作“UF”位置，但实际上不是我们之前坐标系的那个UF，
现在只是相对而言。
2.然后对剩下的E2，E3的位置分类讨论即可：
或者直接对E1,E2,E3进行全体分类
{
  1.3个同面：
    {
      1.逆时针顺序是E1,E2,E3:使用若干次g3变式，将E1先恢复，其他自动也会恢复。因此得到e。
      2x.逆时针顺序是E1,E3,E2:这样的状态经过若干次g3变式，现将E1恢复原位置后。发现还有E2,E3没有恢复。
      这样的排列不是3循环，是2循环。因此这种情况不应该在讨论范围内，是一个“伪3循环”。
    }
  2.2个同面：
    {
      1.2个同面在U面，即E2也在U面：
        {
          --todo
          1.E3在U和D的中层：
            {
              由于对称性，不失一般性，只需要把E3放在6，然后和U面的2个块随机组合：12，13，14，23，24，34。
              这里只对613:交换子要用到中层变换。
            }
          2.E3在D层：
        }
      2.2个同面不在U面,即E2和E3同面：
        {
          1.E2和E3都在侧面，即在F,R,B,L面：
            {
              1.E2和E3都在F面:
              2.E2和E3都在R面:
              3.E2和E3都在B面:
              4.E2和E3都在L面:
            }
          2.E2和E3在D面：
        }
    }
  3.1个同面，即3个都不同面，即E2,E3都不在U面：
    {
      1.E2在F,R,B,L面：
        {
          1.E3在F,R,B,L面：
            {
              即E2和E3在F,R,B,L中不同的两个面，分类讨论：
              {

              }
            }
          2.E3在D面：
            {

            }
        }
      2.E2在D面：
        {
          1.E3在F,R,B,L面：
            {

            }
          2x.E3在D面：转化成就是2个同面了。
        }
    }
}
