


g∈ G2
1.g使得棱块保持2个新轨道。{1,3,9,11},{2,4,10,12}
2.g使得角块保持2个新轨道。{1,3,6,8},{2,4,5,7}
3.g使得{1,3,6,8}单纯改变角块3循环位置，方向数不变。 => False
4.g使得{2,4,5,7}单纯改变角块3循环位置，方向数不变。 => False

  =>

g∈G3

---------证明：
1.换成新目标：g可以用G3中的生成元素复原回状态e。
2.已知G2和G3中元素不会改变方向数，所以以下只需要分析位置即可。
因此换成新目标：g的角块位置可以通过G3还原成原始排列位置，g的棱块可以通过G3还原成原始排列位置。
3.先分析棱块的位置：
  （这里思路未知：很有可能需要单独还原棱块位置，而不改变任意角块的位置）

4.先分析角块的位置，看看如何还原到8个原始的排列位置，详细步骤：
  （思路还未知，可能的思路：1.通过分类讨论，用到假设条件的3,4推理，再还原若干个后，然后排除那些还没还原的情形，
    因此剩下的一定能自动还原。）
  1.首先还原1，4号位置的白色角块：
    1.1号位置白色UFL：
      1.首先{1，3，6，8}轨道肯定有白色，因为：假设（2），这个轨道{1,3,6,8}中保持有2个白色。
      2.将3或6或8号位置的一个白色，先移到6号位置，然后使用U^2即可到达UFL
      至此1个角块位置已还原。
    2.同样4号位置UBL也是类似，从{2,4,5,7}轨道的2个白色中选一个先到达7号位，然后再用B^2到达UBL。
      至此2个角块位置已还原。
  2.然后再还原3号位的白色角块：
    1.由于{1，3，6，8}轨道还有一个白色，这是因为假设(2)。
    2.将3号位置UBR还原白色角块位置：操作也是先到达6号位置然后使用R^2即可到达UBR。
      至此3个角块位置已还原。
  3.然后考虑2号位置的白色角块：
    1.由于{2,4,5,7}轨道中还有一个白色，这是因为假设(2)。
    分类讨论：
      1.如果白色在2号位置：则不需操作，已还原2号位置。
      2.白色在5:则2-黄，7-黄 ； 6-黄，8-黄。
          1.假设棱块已还原，则棱块排列符号数为0。
          2.角块原排列是12345678
          3.现在是1，4，3正确，但是2跑到了5号位：1X3426X8 , 两个X分别是5，7
          4.因为魔方第二基本定理，棱和角的排列数相等，所以只能是17342658，因为：15342678 =3+1+1=5 ，17342658=5+1+1+1=8，
          5.分析17342658，有没有可能呢？分析轨道{2,4,5,7}，发现这个是一个3循环(7,2,5),使用假设(4),可以退出False，因此白色不在5。
      3.白色在7:
          由于对称性，和上述推理类似吧？所以白色不在7。
      4.总结：{2,4,5,7}轨道中的剩下的1个白色只能在2，因此U面的白色已经全部还原。
    至此4个角块位置已还原。
  4.然后考虑D面的4个角块的位置：
    “正了”“反了”
    1.首先考虑轨道{1，3，6，8}剩下的:
      1.由于只剩下2个D面的位置不知道还原了没有，分类讨论：
        1.初始的6号块在位置6，初始的8号块在位置8:则已经还原位置。
        2.初始的6号块在位置8，初始的8号块在位置6:
    2.考虑轨道{2,4,5,7}剩下的:
