







证明这一步是为了证明所有棱块3循环能还原，因此能生成所有A12（全体方向数为0，角块位置id）。

g3:R U' R U R U R U' R' U' R R
σ(g3) =(1,2,4)
目标：任意棱块3循环（棱块方向数为0，角块位置为id），可以用g3和g3变式和交换子模式还原成e。
（硬要一个个列举的话，12个选3循环有220中不同的。）
证明：
1.要对这3循环的位置进行分类，首先为了不失一般性，
把其中一个棱块E1放在人的正面朝上的位置，
换句话说，就是把E1当作“UF”位置，建立新的坐标系,但实际上不是我们之前坐标系的那个UF，
现在只是相对而言。
2.然后对剩下的E2，E3的位置分类讨论即可：
或者直接对E1,E2,E3进行全体分类
{
  1.1个面包含了3个棱块，这样的面有1个的情况：
    {
      1.逆时针顺序是E1,E2,E3:使用若干次g3变式，将E1先恢复，其他自动也会恢复。因此得到e。
      2x.逆时针顺序是E1,E3,E2:这样的状态经过若干次g3变式，现将E1恢复原位置后。发现还有E2,E3没有恢复。
      这样的排列不是3循环，是2循环。因此这种情况不应该在讨论范围内，是一个“伪3循环”。
    }
  上述1除外的情况里，还有：
  2.1个面包含了2个棱块，这样的面有3个的情况：
    {
      1.E1,E2,E3在{1,2,6}中取:交换子要用到中层变换。
      2.E1,E2,E3在{1,4,5}中取:由于对称性，归化为{1,2,6}。
    }
  3.1个面包含了2个棱块，这样的面有2个的情况：
    {
      1.3,1,9:交换子。
      2.1,3,11:交换子。
      3.1,3,7:用到中层的交换子。
      4.1,3,8:由于对称性，和1,3,7情况类似。
      5.1,4,8:交换子。
      6.1,4,12：交换子。
      8.1,2,X:归化为1.4.X
      9.1,2,X:归化为1.4.X
      下面的由于对称性都可以归化成上面的情况：
      10.1,5,X:归化为1.4.X
      11.1,6,X:归化为1.2.X
      12.1,9,X:归化为1.3.X
    }
  4.1个面包含了2个棱块，这样的面有1个的情况：
    {
      1.1,3,{9,10,11,12}:由对称性，12的情况归化到10，11的情况归化到9。所以只需讨论:
        {
          1.1,3,10:交换子。
          2.1,3,9:交换子。
        }
    }
  5.1个面包含了2个棱块，这样的面有0个的情况：
    首先筛选剩下了这些可供E2,E3选择{BL,DL,BR,DR,BU,BD,DF} = {8,12,7,10,3,11,9}：
    由于对称性，BL→BR,DL→DR,BU→DF,BD , 即{7,10,9,11}
    E2从这4个归化的里面选：
    {
      1.7:
        {
          12:2次交换子
        }
      2.10:
        {
          8:2次交换子
        }
      3.9:
        {
          7,8都可以，由于对称性8→7
          7:交换子。
        }
      4.11:
        {
          因为放下第3个的话，必然不符合“1个面包含了2个棱块，这样的面有0”的性质。所以不能归类到这里，必然归化到其他某一个分类。
        }
    }
}



g4: R' F' F' F' R' B B R' R' R' F' R' B B R' R'
ρ(g4) =(2,4,3)
目标：任意角块3循环（角块方向数为0，棱块位置为id），可以用g4和g4变式和交换子模式还原成e。
（硬要一个个列举的话，8个选3循环有56中不同的。）
证明：
1.要对这3循环的位置进行分类，首先为了不失一般性，
把其中一个角块V1放在人的正面朝右上的位置，
换句话说，就是把V1当作“UFR”位置（2），建立新的坐标系,所以实际上不是我们之前坐标系的那个UFR，
现在只是相对而言。
2.然后对剩下的V2，V3的位置分类讨论即可：
或者直接对V1,V2,V3进行全体分类:
{
  1.1个面包含了3个角块，这样的面有1个的情况：
  {
    1.V1,V2,V3逆时针排列：执行若干次g4变式，将V1先恢复，则其他也跟着恢复。得到e。
    2.V1,V2,V3顺时针排列：执行若干次g4变式，将V1先恢复，发现其实是2循环，所以不在目前分类中。不属于V1,V2,V3的3循环。
    --todo 2，3，6怎么办？
  }
  上述1除外的情况里，还有：
  2.1个面包含了2个角块，这样的面有3个的情况：
  {
    1.2,1,X:分类：
      {
        2,1,7: 交换子。
        2,1,8: 交换子。
      }
    2.2,4,X:分类：
      {
        2,4,8: 3次交换子。
        2,4,5: D' (2,4,8) D 即可。
        2,4,7: D' (2,4,6) D 即可。
        2,4,6: 3次交换子。
          先搞一个(2,3,6)交换子，记下来：D' L L g4 L L D
          复原，使用(2,4,3)
          然后使用(2,3,6) 2次？，把3还原，
          最终得到（2，4，6）: g4 (D' L L g4 L L D) (D' L L g4 L L D)
          简化成了：R R D D L L D R R D' L L D R R D R R
      }
    3.2,3,X:
      {
        2,3,5:交换子。
        2,3,8:交换子。
      }
    4.2,7,X:
      {
        2,7,1:上面已存在。
        2,7,4:上面已存在。
        2,7,5:L L (2,4,7) L' L'即可。
        2,7,8:
      }
    5.2,6,X:
      {
        2,6,4:上面已存在。
        2,6,8:
      }
    6.2,5,X:
      {
        2,5,4:上面已存在。
        2,5,3:上面已存在。
        2,5,7:上面已存在。
        2,5,8:B B (2,5,4) B' B'即可。
      }
    7.2,8,X:
      {
        2,8,1:上面已存在。
        2,8,3:上面已存在。
        2,8,4:上面已存在。
        2,8,5:上面已存在。
        2,8,6:上面已存在。
        2,8,7:上面已存在。
      }
  }
  3.1个面包含了2个角块，这样的面有2个的情况：
  {
    1.2,1,X: 不存在
    2.2,4,X: 不存在
    3.2,3,X: 不存在
    4.2,7,X: 不存在
    5.2,6,X: 不存在
    6.2,5,X: 不存在
    7.2,8,X: 不存在
  }
  4.1个面包含了2个角块，这样的面有1个的情况：
  {
    不可能存在这种情况。
  }
  5.1个面包含了2个角块，这样的面有0个的情况：
  {
    不可能存在这种情况。
  }
}
